package tui

// Имена tui страниц.
const (
	Home        = "home"         // приветственная страница
	Login       = "login"        // страница авторизации пользователя
	Register    = "register"     // страница регистрации пользователя
	Data        = "data"         // страница с данными пользователя
	Add         = "add"          // страница для добавления новых данных
	View        = "view"         // страница для отображения данных пользователя
	AddPassword = "add_password" // страница добавления нового пароля
	AdddText    = "add_text"     // страница для добавления нового текста
	AddBinary   = "add_binary"   // страница для добавления бинарных данных
	AddBankCard = "add_bankcard" // страница для добавления новой банковской карты
)
