package tui

// Имена tui страниц.
const (
	Home         = "home"          // приветственная страница
	Login        = "login"         // страница авторизации пользователя
	Register     = "register"      // страница регистрации пользователя
	Data         = "data"          // страница с данными пользователя
	Add          = "add"           // страница для добавления новых данных
	View         = "view"          // страница для отображения данных пользователя
	AddPassword  = "add_password"  // страница добавления нового пароля
	AddText      = "add_text"      // страница для добавления нового текста
	AddBinary    = "add_binary"    // страница для добавления бинарных данных
	AddBankCard  = "add_bankcard"  // страница для добавления новой банковской карты
	Delete       = "delete"        // страница для удаления данных пользователя по имени данных
	EditPassword = "edit_password" // страница для изменения существующего пароля пользователя
	EditText     = "edit_text"     // страница для изменения существующего текста пользователя
	EditBinary   = "edit_binary"   // страница для изменения существующих бинарных данных пользователя
	EditBankCard = "edit_bankcard" // страница для изменения существующих данных банковской карты
	Edit         = "edit"          // страница для изменения существующих данных
)
